# FaceSecondDerivatives Properties

---
The FaceSecondDerivatives type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MixedDerivative|  The mixed derivative.
| UUDerivative|  The second derivative with respect to U.
| VVDerivative|  The second derivative with respect to V.
Top
#### Reference
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace